-- noinspection SqlNoDataSourceInspectionForFile

/*
Navicat MySQL Data ResidentTransfer

Source Server         : 本地mysql
Source Server Version : 80015
Source Host           : localhost:3306
Source Database       : ywt

Target Server Type    : MYSQL
Target Server Version : 80015
File Encoding         : 65001

Date: 2019-04-14 14:30:50
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for t_menu
-- ----------------------------
DROP TABLE IF EXISTS `t_menu`;
CREATE TABLE `t_menu` (
  `ID` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `MENU_NAME` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '系统菜单名称',
  `MENU_CODE` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '系统菜单编码',
  `MENU_ICON` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '系统菜单图标',
  `MENU_URL` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '系统菜单访问路径',
  `REQUEST_URI` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '菜单请求路径',
  `SORT_INDEX` int(10) NOT NULL DEFAULT '0' COMMENT '系统菜单排序',
  `PARENT_ID` bigint(20) DEFAULT NULL COMMENT '父级菜单ID',
  `MODULE_ID` bigint(20) DEFAULT NULL COMMENT '系统模块ID',
  `MENU_LEVEL` int(20) NOT NULL DEFAULT '1' COMMENT '系统菜单层级',
  `IS_LAST_ONE` int(10) NOT NULL COMMENT '是否末级菜单',
  `CREATE_TIME` datetime NOT NULL COMMENT '创建时间',
  `LAST_UPDATE_TIME` datetime DEFAULT NULL COMMENT '数据的最后修改时间.',
  `DESCRIPTION` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '系统菜单描述',
  `ENABLED` int(10) NOT NULL DEFAULT '0' COMMENT '是否启用(1=启用，0=禁用)',
  `DEL_FLAG` int(10) NOT NULL COMMENT '删除标记',
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB AUTO_INCREMENT=386 DEFAULT CHARSET=utf8 COMMENT='系统菜单信息表';

-- ----------------------------
-- Records of t_menu
-- ----------------------------
INSERT INTO `t_menu` VALUES ('348', '水费查交', '0001', '/001', '/001', '/001', '1', '0', '0', '1', '2', '2019-04-14 14:25:42', '2019-04-14 14:25:44', '系统主菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('349', '业务办理', '0002', '/002', '/002', '/002', '2', '0', '0', '1', '2', '2019-04-14 14:22:57', '2019-04-14 14:23:00', '系统主菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('350', '网上客服', '0003', '/003', '/003', '/003', '3', '0', '0', '1', '2', '2019-04-14 13:37:09', '2019-04-14 13:37:09', '系统主菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('351', '服务信息', '0004', '/004', '/004', '/004', '4', '0', '0', '1', '2', '2019-04-14 13:39:21', '2019-04-14 13:39:21', '系统主菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('352', '系统宣传', '0005', '/005', '/005', '/005', '5', '0', '0', '1', '2', '2019-04-14 13:40:04', '2019-04-14 13:40:04', '系统主菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('353', '系统设置', '0006', '/006', '/006', '/006', '6', '0', '0', '1', '2', '2019-04-14 13:40:38', '2019-04-14 13:40:38', '系统主菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('354', '水费账单', '00011', '/001_1', '/001/001', '/001/001', '1', '350', '0', '2', '2', '2019-04-14 13:50:15', '2019-04-14 13:50:15', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('355', '水费预存', '00012', '/001_2', '/001/001', '/001/002', '2', '350', '0', '2', '2', '2019-04-14 13:51:11', '2019-04-14 13:51:11', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('356', '水费缴纳', '00013', '/001_3', '/001/003', '/001/003', '3', '350', '0', '2', '2', '2019-04-14 13:51:59', '2019-04-14 13:51:59', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('357', '我的档案', '00014', '/001_4', '/001/004', '/001/004', '4', '350', '0', '2', '2', '2019-04-14 13:53:27', '2019-04-14 13:53:27', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('358', '办理进度', '00021', '/002_1', '/002/001', '/002/001', '1', '351', '0', '2', '2', '2019-04-14 13:55:38', '2019-04-14 13:55:38', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('359', '居民新装用水', '00022', '/002_2', '/002/002', '/002/002', '2', '351', '0', '2', '2', '2019-04-14 13:56:15', '2019-04-14 13:56:15', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('360', '工商客户新装', '00023', '/002_3', '/002/003', '/002/003', '3', '351', '0', '2', '2', '2019-04-14 13:57:05', '2019-04-14 13:57:05', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('361', '临时施工用水', '00024', '/002_4', '/002/004', '/002/004', '4', '351', '0', '2', '2', '2019-04-14 13:57:47', '2019-04-14 13:57:47', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('362', '居民过户', '00025', '/002_5', '/002/005', '/002/005', '5', '351', '0', '2', '2', '2019-04-14 14:03:06', '2019-04-14 14:03:09', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('363', '居民改移装', '00026', '/002_6', '/002/006', '/002/006', '6', '351', '0', '2', '2', '2019-04-14 14:04:06', '2019-04-14 14:04:06', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('364', '工商改移装', '00027', '/002_7', '/002/007', '/002/007', '7', '351', '0', '2', '2', '2019-04-14 14:04:38', '2019-04-14 14:04:38', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('365', '工商客户过户', '00028', '/002_8', '/002/008', '/002/008', '8', '351', '0', '2', '2', '2019-04-14 14:05:36', '2019-04-14 14:05:36', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('366', '低保户优惠', '00029', '/002_9', '/002/009', '/002/009', '9', '351', '0', '2', '2', '2019-04-14 14:06:16', '2019-04-14 14:06:16', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('367', '短信订阅', '000210', '/002_10', '/002/0010', '/002/0010', '10', '351', '0', '2', '2', '2019-04-14 14:06:59', '2019-04-14 14:06:59', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('368', '档案错误申报', '000211', '/002_11', '/002/0011', '/002/0011', '11', '351', '0', '2', '2', '2019-04-14 14:07:23', '2019-04-14 14:07:23', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('369', '开票信息维护', '000212', '/002_12', '/002/0012', '/002/0012', '12', '351', '0', '2', '2', '2019-04-14 14:07:56', '2019-04-14 14:07:56', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('370', '验表申请', '000213', '/002_13', '/002/0013', '/002/0013', '13', '351', '0', '2', '2', '2019-04-14 14:08:33', '2019-04-14 14:08:33', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('371', '暂停申请', '000214', '/002_14', '/002/0014', '/002/0014', '14', '351', '0', '2', '2', '2019-04-14 14:09:53', '2019-04-14 14:09:53', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('372', '复装申请', '000215', '/002_15', '/002/0015', '/002/0015', '15', '351', '0', '2', '2', '2019-04-14 14:10:28', '2019-04-14 14:10:28', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('373', '销户申请', '000216', '/002_16', '/002/0016', '/002/0016', '16', '351', '0', '2', '2', '2019-04-14 14:11:06', '2019-04-14 14:11:06', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('374', '用水人口变更', '000217', '/002_17', '/002/0017', '/002/0017', '17', '351', '0', '2', '2', '2019-04-14 14:11:30', '2019-04-14 14:11:30', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('375', '用水性质变更', '000218', '/002_18', '/002/0018', '/002/0018', '18', '351', '0', '2', '2', '2019-04-14 14:11:50', '2019-04-14 14:11:50', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('376', '故障报修', '000219', '/002_19', '/002/0019', '/002/0019', '19', '351', '0', '2', '2', '2019-04-14 14:12:22', '2019-04-14 14:12:22', '业务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('377', '在线客服', '00031', '/003_1', '/003/001', '/003/001', '1', '352', '0', '2', '2', '2019-04-14 14:16:42', '2019-04-14 14:16:42', '服务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('378', '报漏', '00032', '/003_2', '/003/002', '/003/002', '2', '352', '0', '2', '2', '2019-04-14 14:17:01', '2019-04-14 14:17:01', '服务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('379', '违规举报', '00033', '/003_3', '/003/003', '/003/003', '3', '352', '0', '2', '2', '2019-04-14 14:17:21', '2019-04-14 14:17:21', '服务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('380', '投诉建议', '00034', '/003_4', '/003/004', '/003/004', '4', '352', '0', '2', '2', '2019-04-14 14:17:40', '2019-04-14 14:17:40', '服务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('381', '问卷调查', '00035', '/003_5', '/003/005', '/003/005', '5', '352', '0', '2', '2', '2019-04-14 14:18:00', '2019-04-14 14:18:00', '服务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('382', '水价标准', '00041', '/004_1', '/004/001', '/004/001', '1', '352', '0', '2', '2', '2019-04-14 14:18:50', '2019-04-14 14:18:50', '服务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('383', '交费方式', '00042', '/004_2', '/004/002', '/004/002', '2', '352', '0', '2', '2', '2019-04-14 14:19:18', '2019-04-14 14:19:18', '服务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('384', '公告', '00043', '/004_3', '/004/003', '/004/003', '3', '352', '0', '2', '2', '2019-04-14 14:19:33', '2019-04-14 14:19:33', '服务菜单', '1', '0');
INSERT INTO `t_menu` VALUES ('385', '业务流程', '00044', '/004_4', '/004/004', '/004/004', '4', '352', '0', '2', '2', '2019-04-14 14:19:50', '2019-04-14 14:19:50', '服务菜单', '1', '0');
